// mockData.dart
final List<Map<String, dynamic>> mockFeedBooks = [
  {
    'image': 'assets/images/sample-book-01.jpg',
    'title': '왜 나는 너를 사랑하는가',
    'author': '알랭 드 보통',
    'summary':
        '최진영 소설 『구의 증명』은 사랑하는 연인의 갑작스러운 죽음 이후 겪게 되는 상실과 애도의 과정을 통해 삶의 의미 혹은 죽음의 의미를 되묻는 소설이다. 이 작품에서 최진영은 퇴색하지 않는 사랑의 가치를 전면에 내세우고 아름다운 문장과 감성적이며 애절한 감수성을 통해 젊고 아름다운 남녀의 열정적인 사랑과 냉정한 죽음에 대해 세련된 감성과 탁월한 문체로 담아내고 있다.',
    'date': '2024.10.22',
    'readingTime': '21분 45초 읽음',
  },
  {
    'image': 'assets/images/sample-book-02.jpg',
    'title': '구의 증명',
    'author': '최진영',
    'summary':
        '최진영 소설 『구의 증명』은 사랑하는 연인의 갑작스러운 죽음 이후 겪게 되는 상실과 애도의 과정을 통해 삶의 의미 혹은 죽음의 의미를 되묻는 소설이다. 이 작품에서 최진영은 퇴색하지 않는 사랑의 가치를 전면에 내세우고 아름다운 문장과 감성적이며 애절한 감수성을 통해 젊고 아름다운 남녀의 열정적인 사랑과 냉정한 죽음에 대해 세련된 감성과 탁월한 문체로 담아내고 있다.',
    'date': '2024.10.22',
    'readingTime': '21분 45초 읽음',
  },
  {
    'image': 'assets/images/sample-book-03.jpg',
    'title': '천 개의 파랑',
    'author': '천선란',
    'summary':
        '최진영 소설 『구의 증명』은 사랑하는 연인의 갑작스러운 죽음 이후 겪게 되는 상실과 애도의 과정을 통해 삶의 의미 혹은 죽음의 의미를 되묻는 소설이다. 이 작품에서 최진영은 퇴색하지 않는 사랑의 가치를 전면에 내세우고 아름다운 문장과 감성적이며 애절한 감수성을 통해 젊고 아름다운 남녀의 열정적인 사랑과 냉정한 죽음에 대해 세련된 감성과 탁월한 문체로 담아내고 있다.',
    'date': '2024.10.22',
    'readingTime': '21분 45초 읽음',
  },
  // Add more mock books as needed
];
